#pragma once
#include "User.h"
#include "Chat.h"




//предварительное объ¤влени¤ классов
//используемых при определении класса Interface

class User;
class Chat;

//класс реализует общение между пользователем и внутренними классами программы
class Interface
{
public:

	//конструктор и деструктор
	Interface()
	{}
	~Interface() {}


	//РїРµСЂРІС‹Р№ СѓСЂРѕРІРµРЅСЊ РёРЅС‚РµСЂС„СЌР№СЃР° РѕР±С‰РµРЅРёСЏ
	bool Enable(Chat& chat);//Р±СѓР»РµРІР° С„СѓРЅРєС†РёСЏ РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ РІРѕ РІРЅРµС€РЅРµРј С†РёРєР»Рµ Р·Р°РїСѓСЃРєР°

	//С„СѓРЅРєС†РёРё СЂР°Р±РѕС‚Р°СЋС‚ РІ РїРµСЂРІРѕРј СѓСЂРѕРІРЅРµ РёРЅС‚РµСЂС„СЌР№СЃР° Рё РІС‹Р·С‹РІР°СЋС‚СЃВ¤ РёР· Enable()
	static void registration(Chat& cht);
	void logIn(Chat& cht);
	void quit(Chat& cht);

	//РІС‚РѕСЂРѕР№ СѓСЂРѕРІРµРЅСЊ РёРЅС‚РµСЂС„СЌР№СЃР°
	bool startChat(Chat& cht);

	//С‡РёС‚Р°РµС‚ РІРІРѕРґ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ РґР»СЏ С„РѕСЂРјРёСЂРѕРІР°РЅРёСЏ С‚РµРєСЃС‚Р° СЃРѕРѕР±С‰РµРЅРёСЏ
	static void readTheInput(std::string& str);

private:
	//РїРµСЂРµРјРµРЅРЅС‹Рµ РєРѕРЅС‚СЂРѕР»РёСЂСѓСЋС‚ РїРѕРґРєР»СЋС‡РµРЅРёРµ СѓСЂРѕРІРЅСЏ РёРЅС‚РµСЂС„СЌР№СЃР°
	bool enable = true;//РїРѕРґРєР»СЋС‡Р°РµС‚ 1-С‹Р№ СѓСЂРѕРІРµРЅСЊ РёРЅС‚РµСЂС„СЌР№СЃР°
	bool LoggedIn = false;//РїРѕРґРєР»СЋС‡Р°РµС‚ 1-С‹Р№ СѓСЂРѕРІРµРЅСЊ РёРЅС‚РµСЂС„СЌР№СЃР°

	//СѓРєР°Р·Р°С‚РµР»СЊ РЅР° СЋР·РµСЂР°, РєРѕС‚РѕСЂС‹Р№ РІРѕС€РµР» С‡РµСЂРµР· РїСЂРѕС†РµРґСѓСЂСѓ РІРІРѕРґР° РїР°СЂРѕР»СЏ РІРѕ 2-РѕР№ СѓСЂРѕРІРµРЅСЊ РёРЅС‚РµСЂС„СЌР№СЃР°
	User* active_user = nullptr;

};